src/test/resources/soap/request/request-not-secured.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Header />
    <soapenv:Body>
        <ent:getEntityRequest xmlns:ent="http://bernardomg.com/example/ws/entity">
            <ent:id>1</ent:id>
        </ent:getEntityRequest>
    </soapenv:Body>
</soapenv:Envelope>